IDENTIFICATION DIVISION. PROGRAM-ID. HELLO-WORLD. DATA DIVISION. WORKING-STORAGE SECTION. 01 MESSAGE PIC X(10) VALUE "Olá, Mundo!". PROCEDURE DIVISION. MAIN-PROCEDURE. DISPLAY MESSAGE. STOP RUN.
